OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf45k22.h
extern __at(0x0F82) volatile __PORTCbits_t PORTCbits;

#define _PORTC_RC0              0x01
#define _PORTC_T1OSO            0x01
#define _PORTC_P2B              0x01
#define _PORTC_T1CKI            0x01
#define _PORTC_T3CKI            0x01
#define _PORTC_T3G              0x01
#define _PORTC_RC1              0x02
#define _PORTC_T1OSI            0x02
#define _PORTC_P2A              0x02
#define _PORTC_CCP2             0x02
#define _PORTC_RC2              0x04
#define _PORTC_T5CKI            0x04
#define _PORTC_P1A              0x04
#define _PORTC_CCP1             0x04
#define _PORTC_CTPLS            0x04
#define _PORTC_AN14             0x04
#define _PORTC_RC3              0x08
#define _PORTC_SCK              0x08
#define _PORTC_SCL              0x08
#define _PORTC_SCK1             0x08
#define _PORTC_SCL1             0x08
#define _PORTC_AN15             0x08
#define _PORTC_RC4              0x10
#define _PORTC_SDI              0x10
#define _PORTC_SDA              0x10
#define _PORTC_SDI1             0x10
#define _PORTC_SDA1             0x10
#define _PORTC_AN16             0x10
#define _PORTC_RC5              0x20
#define _PORTC_SDO              0x20
#define _PORTC_SDO1             0x20
#define _PORTC_AN17             0x20
#define _PORTC_RC6              0x40
#define _PORTC_TX               0x40
#define _PORTC_CK               0x40
#define _PORTC_TX1              0x40
#define _PORTC_CK1              0x40
#define _PORTC_AN18             0x40
#define _PORTC_RC7              0x80
#define _PORTC_RX               0x80
#define _PORTC_RX1              0x80
#define _PORTC_DT1              0x80
#define _PORTC_AN19             0x80

//==============================================================================


//==============================================================================
//        PORTD Bits

extern __at(0x0F83) __sfr PORTD;

typedef union
  {
  struct
    {
    unsigned RD0                : 1;
    unsigned RD1                : 1;
    unsigned RD2                : 1;
    unsigned RD3                : 1;
    unsigned RD4                : 1;
    unsigned RD5                : 1;
    unsigned RD6                : 1;
    unsigned RD7                : 1;
    };

  struct
    {
    unsigned SCK2               : 1;
    unsigned CCP4               : 1;
    unsigned P2B                : 1;
    unsigned P2C                : 1;
    unsigned P2D                : 1;
    unsigned P1B                : 1;
    unsigned P1C                : 1;
    unsigned P1D                : 1;
    };

  struct
    {
    unsigned SCL2               : 1;
    unsigned SDI2               : 1;
    unsigned AN22               : 1;
    unsigned NOT_SS2            : 1;
    unsigned SDO2               : 1;
    unsigned AN25               : 1;
    unsigned TX2                : 1;
    unsigned RX2                : 1;
    };

  struct
    {
    unsigned AN20               : 1;
    unsigned SDA2               : 1;
    unsigned                    : 1;
    unsigned SS2                : 1;
    unsigned AN24               : 1;
    unsigned                    : 1;
    unsigned CK2                : 1;
    unsigned DT2                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned AN21               : 1;
    unsigned                    : 1;
    unsigned AN23               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AN26               : 1;
    unsigned AN27               : 1;
    };
  } __PORTDbits_t;

extern __at(0x0F83) volatile __PORTDbits_t PORTDbits;

#define _PORTD_RD0              0x01
#define _PORTD_SCK2             0x01
#define _PORTD_SCL2             0x01
#define _PORTD_AN20             0x01
#define _PORTD_RD1              0x02
#define _PORTD_CCP4             0x02
#define _PORTD_SDI2             0x02
#define _PORTD_SDA2             0x02
#define _PORTD_AN21             0x02
#define _PORTD_RD2              0x04
#define _PORTD_P2B              0x04
#define _PORTD_AN22             0x04
#define _PORTD_RD3              0x08
#define _PORTD_P2C              0x08
#define _PORTD_NOT_SS2          0x08
#define _PORTD_SS2              0x08
#define _PORTD_AN23             0x08
#define _PORTD_RD4              0x10
#define _PORTD_P2D              0x10
#define _PORTD_SDO2             0x10
#define _PORTD_AN24             0x10
#define _PORTD_RD5              0x20
#define _PORTD_P1B              0x20
#define _PORTD_AN25             0x20
#define _PORTD_RD6              0x40
#define _PORTD_P1C              0x40
#define _PORTD_TX2              0x40
#define _PORTD_CK2              0x40
#define _PORTD_AN26             0x40
#define _PORTD_RD7              0x80
#define _PORTD_P1D              0x80
#define _PORTD_RX2              0x80
#define _PORTD_DT2              0x80
#define _PORTD_AN27             0x80

//==============================================================================


//==============================================================================
//        PORTE Bits

extern __at(0x0F84) __sfr PORTE;

typedef union
  {
  struct
    {
    unsigned RE0                : 1;
    unsigned RE1                : 1;
    unsigned RE2                : 1;
    unsigned RE3                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned AN5                : 1;
    unsigned AN6                : 1;
    unsigned AN7                : 1;
    unsigned MCLR               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P3A                : 1;
    unsigned P3B                : 1;
    unsigned CCP5               : 1;
    unsigned NOT_MCLR           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP3               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned VPP                : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RE                 : 4;
    unsigned                    : 4;
    };
  } __PORTEbits_t;

